feature: added extensive documentation for this repo
